# Pandas fundamentals

**Credits**: Based on the [_Python Data Science Handbook_ by Jake VanderPlas](https://jakevdp.github.io/PythonDataScienceHandbook/)

## Series object

Pandas **Series** is a one-dimensional array of indexed data. It can be created from a list or array as follows

In [176]:
import numpy as np
import pandas as pd

In [177]:
data = pd.Series([0.25, 0.5, 0.75, 1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

*Series* wraps both a *sequence of values* and a *sequence of indices*. The values are simply a familiar NumPy array:

In [178]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

The index is an array-like object of type `pd.Index`

In [30]:
data.index

RangeIndex(start=0, stop=4, step=1)

Like with a NumPy array, data can be accessed by the associated index via the familiar Python square-bracket notation.
However, as we will see, though, the Pandas Series is much more general and flexible than the one-dimensional NumPy array that it emulates

In [31]:
data[1]

0.5

In [32]:
data[1:3]

1    0.50
2    0.75
dtype: float64

### Series as a generalized NumPy array

In [41]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['mau', 'medio', 'bom', 'cool'])
data

mau      0.25
medio    0.50
bom      0.75
cool     1.00
dtype: float64

In [46]:
data['medio']

0.5

In [45]:
# Ser√° que funciona? 
data['medio':'cool']

medio    0.50
bom      0.75
cool     1.00
dtype: float64

### Series as specialized dictionary

In [5]:
population_dict = {'California': 38332521,
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}
population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [6]:
population['California']

38332521

## The Pandas DataFrame Object

In [8]:
area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297,
             'Florida': 170312, 'Illinois': 149995}
area = pd.Series(area_dict)
area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

In [46]:
states = pd.DataFrame({'population': population, 'area': area})
states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

Like the Series object, the DataFrame has an index attribute that gives access to the index labels:

In [15]:
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

Additionally, the DataFrame has a columns attribute, which is an Index object holding the column labels:

In [16]:
states.columns

Index(['population', 'area'], dtype='object')

We can also think of a DataFrame as a specialization of a dictionary. Where a dictionary maps a key to a value, a DataFrame maps a column name to a Series of column data.

In [17]:
states['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

### Constructing DataFrame objects
A Pandas `DataFrame` can be constructed in a variety of ways. Here we'll give several examples.

From a single Series object:

In [18]:
pd.DataFrame(population, columns=['population'])

            population
California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135

From a dictionary of Series objects:

In [ ]:
pd.DataFrame({'population': population,
              'area': area})

Even if some keys in the dictionary are missing, Pandas will fill them in with NaN (i.e., "not a number") values:

In [20]:
pd.DataFrame([{'a': 1, 'b': 2}, {'b': 3, 'c': 4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

From a two-dimensional NumPy array

In [107]:
data = pd.DataFrame(np.random.rand(3, 2), columns=['foo', 'bar'], index=['a', 'b', 'c'])
data

        foo       bar
a  0.911776  0.385690
b  0.681402  0.894468
c  0.876062  0.578630

As mentioned previously, we can also view the DataFrame as an enhanced two-dimensional array. We can examine the raw underlying data array using the values attribute:

In [112]:
data.values

array([[0.91177638, 0.38568953],
       [0.68140173, 0.89446831],
       [0.87606174, 0.57863017]])

With this picture in mind, many familiar array-like observations can be done on the DataFrame itself. For example, we can transpose the full DataFrame to swap rows and columns:

In [113]:
data.T

            a         b         c
foo  0.911776  0.681402  0.876062
bar  0.385690  0.894468  0.578630

## The Pandas Index Object

This Index object is an interesting structure in itself, and it can be thought of either as an immutable array or as an ordered set

In [27]:
ind = pd.Index([2, 3, 5, 7, 11])
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

In [28]:
ind[1]

3

In [ ]:
ind[::2]

One difference between Index objects and NumPy arrays is that indices are immutable‚Äìthat is, they cannot be modified via the normal means:

In [64]:
# Do your guess what is the result ?
ind[1] = 0

TypeError: Index does not support mutable operations

Pandas objects are designed to facilitate operations such as joins across datasets, which depend on many aspects of set arithmetic. The Index object follows many of the conventions used by Python's built-in set data structure, so that unions, intersections, differences, and other combinations can be computed in a familiar way:

In [32]:
indA = pd.Index([1, 3, 5, 7, 9])
indB = pd.Index([2, 3, 5, 7, 11])

In [33]:
indA & indB  # intersection

Int64Index([3, 5, 7], dtype='int64')

In [34]:
indA | indB  # union

Int64Index([1, 2, 3, 5, 7, 9, 11], dtype='int64')

In [35]:
indA ^ indB  # symmetric difference

Int64Index([1, 2, 9, 11], dtype='int64')

# Data Indexing and Selection

### Series

In [66]:
data = pd.Series([0.25, 0.5, 0.75, 1.0], index=['mau', 'medio', 'bom', 'cool'])
data

mau      0.25
medio    0.50
bom      0.75
cool     1.00
dtype: float64

In [67]:
'medio' in data

True

In [68]:
data.keys()

Index(['mau', 'medio', 'bom', 'cool'], dtype='object')

In [69]:
list(data.items())

[('mau', 0.25), ('medio', 0.5), ('bom', 0.75), ('cool', 1.0)]

In [73]:
data["bom"] = 0.76

In [71]:
# slicing by explicit index
data['mau':'bom']

mau      0.25
medio    0.50
bom      0.80
dtype: float64

In [72]:
# slicing by implicit integer index
data[0:2]

mau      0.25
medio    0.50
dtype: float64

In [76]:
# masking
data[(data > 0.3) & (data < 0.8)]

medio    0.50
bom      0.76
dtype: float64

In [78]:
# fancy indexing
data[['bom', 'mau']]

bom    0.76
mau    0.25
dtype: float64

### Indexers: loc, iloc, and ix

slicing and indexing conventions can be a source of confusion. For example, if your Series has an explicit integer index, an indexing operation such as data[1] will use the explicit indices, while a slicing operation like data[1:3] will use the implicit Python-style index.

In [80]:
data = pd.Series(['a', 'b', 'c'], index=[1, 3, 5])
data

1    a
3    b
5    c
dtype: object

In [93]:
# explicit index when indexing
data[1]

'a'

In [94]:
# implicit index when slicing
data[1:3]

3    b
5    c
dtype: object

Because of this potential confusion in the case of integer indexes, Pandas provides some special indexer attributes that explicitly expose certain indexing schemes. First, the loc attribute allows indexing and slicing that always references the explicit index:

In [90]:
data.loc[1]

'a'

In [95]:
data.loc[1:3]

1    a
3    b
dtype: object

The iloc attribute allows indexing and slicing that always references the implicit Python-style index:

In [96]:
data.iloc[1]

'b'

In [97]:
data.iloc[1:3]

3    b
5    c
dtype: object

### Data Selection in DataFrame

In [179]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [161]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [162]:
data['density'] = data['pop'] / data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [163]:
data['density']["California":"New York"]

California     90.413926
Texas          38.018740
New York      139.076746
Name: density, dtype: float64

### Important indexing conventions

First, while indexing refers to columns, slicing refers to rows:

In [164]:
data['California':'New York']

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746

Such slices can also refer to rows by number rather than by index:

In [165]:
data[0:3]

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746

Similarly, **direct masking operations are also interpreted row-wise** rather than column-wise:

In [166]:
data[data.density > 100]

            area       pop     density
New York  141297  19651127  139.076746
Florida   170312  19552860  114.806121

using the `loc` indexer we can index the underlying data in an array-like style but using the explicit index and column names:

In [167]:
data.loc[data["density"] > 100]

            area       pop     density
New York  141297  19651127  139.076746
Florida   170312  19552860  114.806121

In [173]:
data.loc[data["density"] > 100, ['area','pop']]

            area       pop
New York  141297  19651127
Florida   170312  19552860

In [174]:
data.loc[:'New York', :'pop']

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [175]:
data.iloc[:3, :2]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

# Reading and writing data 
Let's create a DataFrame from scratch...

In [3]:
import pandas as pd
data = {
    'apples': [3, 2, 0, 1], 
    'oranges': [0, 3, 7, 2]
}
purchases = pd.DataFrame(data)
purchases

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2

The **Index** of this DataFrame was given to us on creation as the numbers 0-3, but we could also create our own when we initialize the DataFrame. 

Let's have customer names as our index:

In [11]:
purchases = pd.DataFrame(data, index=['June', 'Robert', 'Lily', 'David'])
purchases

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

In [12]:
purchases["apples"]

June      3
Robert    2
Lily      0
David     1
Name: apples, dtype: int64

We can **loc**ate a customer's order by using their name:

In [14]:
purchases.loc["Robert"]

apples     2
oranges    3
Name: Robert, dtype: int64

### Writing to CSV, JSON and SQL files

It‚Äôs quite simple to save and load data from various file formats into a DataFrame.

In [24]:
purchases.to_csv('dados/purchases.csv')

In [27]:
purchases.to_json('dados/purchases.json')

If you‚Äôre working with data from a SQL database you need to first establish a connection using an appropriate Python library, then pass a query to pandas. Here we'll use SQLite to demonstrate.

In [26]:
import sqlite3
con = sqlite3.connect("dados/purchases.sqlite3")
purchases.to_sql('purchases', con)

### Reading from CSV files

In [20]:
df = pd.read_csv('dados/purchases.csv')
df

  Unnamed: 0  apples  oranges
0       June       3        0
1     Robert       2        3
2       Lily       0        7
3      David       1        2

CSVs don't have indexes like our DataFrames, so all we need to do is just designate the `index_col` when reading:

In [21]:
df = pd.read_csv('dados/purchases.csv', index_col=0)
df

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

If you have a JSON file ‚Äî which is essentially a stored Python `dict` ‚Äî pandas can read this just as easily:

### Reading data from JSON

If you have a JSON file ‚Äî which is essentially a stored Python `dict` ‚Äî pandas can read this just as easily:

In [23]:
df = pd.read_json('dados/purchases.json')
df

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

### Reading data from a SQL database

In [16]:
import sqlite3
con = sqlite3.connect("dados/purchases.sqlite3")
df = pd.read_sql_query("SELECT * FROM purchases", con) # index_col='index'
df

    index  apples  oranges
0    June       3        0
1  Robert       2        3
2    Lily       0        7
3   David       1        2

Just like with CSVs, we could pass index_col='index', but we can also set an index after-the-fact:

In [17]:
df = df.set_index('index')
df

        apples  oranges
index
June         3        0
Robert       2        3
Lily         0        7
David        1        2

# Operating on Data in Pandas

Because Pandas is designed to work with NumPy, any NumPy ufunc will work on Pandas Series and DataFrame objects

In [201]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'population':pop})
data

              area  population
California  423967    38332521
Texas       695662    26448193
New York    141297    19651127
Florida     170312    19552860
Illinois    149995    12882135

In [202]:
np.sqrt(data["area"])

California    651.127484
Texas         834.063547
New York      375.894932
Florida       412.688745
Illinois      387.291880
Name: area, dtype: float64

In [203]:
np.sqrt(data)

                  area   population
California  651.127484  6191.326271
Texas       834.063547  5142.780668
New York    375.894932  4432.959170
Florida     412.688745  4421.861599
Illinois    387.291880  3589.169124

In [204]:
np.sum(data["area"])

1581233

In [205]:
population / area

California     90.413926
Texas          38.018740
New York      139.076746
Florida       114.806121
Illinois       85.883763
dtype: float64

### Index alignment in Series

In [200]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                  'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                        'New York': 19651127}, name='population')
population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [198]:
area.index | population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

# Handling Missing Data

In [206]:
# NEXT WEEK ...

In [207]:
# IN THE MEANWHILE LET'S HANDS ON WITH A Practical Example

# Other important DataFrame operations

DataFrames possess hundreds of methods and other operations that are crucial to any analysis. As a beginner, you should know the operations that perform simple transformations of your data and those that provide fundamental statistical analysis.

### (optional) Duplicated values

In [39]:
df = pd.read_csv('dados/purchases.csv')

df2 = df.append(df)  
df2

  Unnamed: 0  apples  oranges
0       June       3        0
1     Robert       2        3
2       Lily       0        7
3      David       1        2
0       June       3        0
1     Robert       2        3
2       Lily       0        7
3      David       1        2

the `drop_duplicates()` method will  return a copy of your DataFrame, but this time with duplicates removed. Calling `.shape` confirms we're back to the 1000 rows of our original dataset.

It's a little verbose to keep assigning DataFrames to the same variable like in this example. For this reason, pandas has the `inplace` keyword argument on many of its methods. Using `inplace=True` will modify the DataFrame object in place:

In [36]:
df2.drop_duplicates()

  Unnamed: 0  apples  oranges
0       June       3        0
1     Robert       2        3
2       Lily       0        7
3      David       1        2

Another important argument for `drop_duplicates()` is `keep`, which has three possible options:

* `first`: (default) Drop duplicates except for the first occurrence.
* `last`: Drop duplicates except for the last occurrence.
* `False`: Drop all duplicates.

Since we didn't define the `keep` arugment in the previous example it was defaulted to `first`. This means that if two rows are the same pandas will drop the second row and keep the first row. Using `last` has the opposite effect: the first row is dropped.

`keep`, on the other hand, will drop all duplicates. If two rows are the same then both will be dropped. Watch what happens to `df2`:

In [37]:
df2.drop_duplicates(inplace=True, keep="first")
df

  Unnamed: 0  apples  oranges
0       June       3        0
1     Robert       2        3
2       Lily       0        7
3      David       1        2